#
# Created by 
#   ../bin/Linux-x86_64-O/oasysGui 19.2-p002 on Fri Dec 16 23:17:26 2022
# (C) Mentor Graphics Corporation
#
set_units -time ns -capacitance ff -resistance kohm -power nW -voltage V -current mA
create_clock -period 2.5 -waveform {0 1.25} -name sysclk [get_ports clk]
set_false_path -from [get_ports reset]
group_path -name I2R -from [list [get_ports enable] [get_ports reset] [get_ports clk] [get_ports {B[0]}] [get_ports {B[1]}] [get_ports {B[2]}] [get_ports {B[3]}] [get_ports {B[4]}] [get_ports {B[5]}] [get_ports {B[6]}] [get_ports {B[7]}] [get_ports {B[8]}] [get_ports {B[9]}] [get_ports {B[10]}] [get_ports {B[11]}] [get_ports {B[12]}] [get_ports {B[13]}] [get_ports {B[14]}] [get_ports {B[15]}] [get_ports {B[16]}] [get_ports {B[17]}] [get_ports {B[18]}] [get_ports {B[19]}] [get_ports {B[20]}] [get_ports {B[21]}] [get_ports {B[22]}] [get_ports {B[23]}] [get_ports {B[24]}] [get_ports {B[25]}] [get_ports {B[26]}] [get_ports {B[27]}] [get_ports {B[28]}] [get_ports {B[29]}] [get_ports {B[30]}] [get_ports {B[31]}] [get_ports {A[0]}] [get_ports {A[1]}] [get_ports {A[2]}] [get_ports {A[3]}] [get_ports {A[4]}] [get_ports {A[5]}] [get_ports {A[6]}] [get_ports {A[7]}] [get_ports {A[8]}] [get_ports {A[9]}] [get_ports {A[10]}] [get_ports {A[11]}] [get_ports {A[12]}] [get_ports {A[13]}] [get_ports {A[14]}] [get_ports {A[15]}] [get_ports {A[16]}] [get_ports {A[17]}] [get_ports {A[18]}] [get_ports {A[19]}] [get_ports {A[20]}] [get_ports {A[21]}] [get_ports {A[22]}] [get_ports {A[23]}] [get_ports {A[24]}] [get_ports {A[25]}] [get_ports {A[26]}] [get_ports {A[27]}] [get_ports {A[28]}] [get_ports {A[29]}] [get_ports {A[30]}] [get_ports {A[31]}]]
group_path -name I2O -from [list [get_ports enable] [get_ports reset] [get_ports clk] [get_ports {B[0]}] [get_ports {B[1]}] [get_ports {B[2]}] [get_ports {B[3]}] [get_ports {B[4]}] [get_ports {B[5]}] [get_ports {B[6]}] [get_ports {B[7]}] [get_ports {B[8]}] [get_ports {B[9]}] [get_ports {B[10]}] [get_ports {B[11]}] [get_ports {B[12]}] [get_ports {B[13]}] [get_ports {B[14]}] [get_ports {B[15]}] [get_ports {B[16]}] [get_ports {B[17]}] [get_ports {B[18]}] [get_ports {B[19]}] [get_ports {B[20]}] [get_ports {B[21]}] [get_ports {B[22]}] [get_ports {B[23]}] [get_ports {B[24]}] [get_ports {B[25]}] [get_ports {B[26]}] [get_ports {B[27]}] [get_ports {B[28]}] [get_ports {B[29]}] [get_ports {B[30]}] [get_ports {B[31]}] [get_ports {A[0]}] [get_ports {A[1]}] [get_ports {A[2]}] [get_ports {A[3]}] [get_ports {A[4]}] [get_ports {A[5]}] [get_ports {A[6]}] [get_ports {A[7]}] [get_ports {A[8]}] [get_ports {A[9]}] [get_ports {A[10]}] [get_ports {A[11]}] [get_ports {A[12]}] [get_ports {A[13]}] [get_ports {A[14]}] [get_ports {A[15]}] [get_ports {A[16]}] [get_ports {A[17]}] [get_ports {A[18]}] [get_ports {A[19]}] [get_ports {A[20]}] [get_ports {A[21]}] [get_ports {A[22]}] [get_ports {A[23]}] [get_ports {A[24]}] [get_ports {A[25]}] [get_ports {A[26]}] [get_ports {A[27]}] [get_ports {A[28]}] [get_ports {A[29]}] [get_ports {A[30]}] [get_ports {A[31]}]]  -to [list [get_ports OVF] [get_ports {Res[0]}] [get_ports {Res[1]}] [get_ports {Res[2]}] [get_ports {Res[3]}] [get_ports {Res[4]}] [get_ports {Res[5]}] [get_ports {Res[6]}] [get_ports {Res[7]}] [get_ports {Res[8]}] [get_ports {Res[9]}] [get_ports {Res[10]}] [get_ports {Res[11]}] [get_ports {Res[12]}] [get_ports {Res[13]}] [get_ports {Res[14]}] [get_ports {Res[15]}] [get_ports {Res[16]}] [get_ports {Res[17]}] [get_ports {Res[18]}] [get_ports {Res[19]}] [get_ports {Res[20]}] [get_ports {Res[21]}] [get_ports {Res[22]}] [get_ports {Res[23]}] [get_ports {Res[24]}] [get_ports {Res[25]}] [get_ports {Res[26]}] [get_ports {Res[27]}] [get_ports {Res[28]}] [get_ports {Res[29]}] [get_ports {Res[30]}] [get_ports {Res[31]}] [get_ports {Res[32]}] [get_ports {Res[33]}] [get_ports {Res[34]}] [get_ports {Res[35]}] [get_ports {Res[36]}] [get_ports {Res[37]}] [get_ports {Res[38]}] [get_ports {Res[39]}] [get_ports {Res[40]}] [get_ports {Res[41]}] [get_ports {Res[42]}] [get_ports {Res[43]}] [get_ports {Res[44]}] [get_ports {Res[45]}] [get_ports {Res[46]}] [get_ports {Res[47]}] [get_ports {Res[48]}] [get_ports {Res[49]}] [get_ports {Res[50]}] [get_ports {Res[51]}] [get_ports {Res[52]}] [get_ports {Res[53]}] [get_ports {Res[54]}] [get_ports {Res[55]}] [get_ports {Res[56]}] [get_ports {Res[57]}] [get_ports {Res[58]}] [get_ports {Res[59]}] [get_ports {Res[60]}] [get_ports {Res[61]}] [get_ports {Res[62]}] [get_ports {Res[63]}]]
group_path -name R2O -to [list [get_ports OVF] [get_ports {Res[0]}] [get_ports {Res[1]}] [get_ports {Res[2]}] [get_ports {Res[3]}] [get_ports {Res[4]}] [get_ports {Res[5]}] [get_ports {Res[6]}] [get_ports {Res[7]}] [get_ports {Res[8]}] [get_ports {Res[9]}] [get_ports {Res[10]}] [get_ports {Res[11]}] [get_ports {Res[12]}] [get_ports {Res[13]}] [get_ports {Res[14]}] [get_ports {Res[15]}] [get_ports {Res[16]}] [get_ports {Res[17]}] [get_ports {Res[18]}] [get_ports {Res[19]}] [get_ports {Res[20]}] [get_ports {Res[21]}] [get_ports {Res[22]}] [get_ports {Res[23]}] [get_ports {Res[24]}] [get_ports {Res[25]}] [get_ports {Res[26]}] [get_ports {Res[27]}] [get_ports {Res[28]}] [get_ports {Res[29]}] [get_ports {Res[30]}] [get_ports {Res[31]}] [get_ports {Res[32]}] [get_ports {Res[33]}] [get_ports {Res[34]}] [get_ports {Res[35]}] [get_ports {Res[36]}] [get_ports {Res[37]}] [get_ports {Res[38]}] [get_ports {Res[39]}] [get_ports {Res[40]}] [get_ports {Res[41]}] [get_ports {Res[42]}] [get_ports {Res[43]}] [get_ports {Res[44]}] [get_ports {Res[45]}] [get_ports {Res[46]}] [get_ports {Res[47]}] [get_ports {Res[48]}] [get_ports {Res[49]}] [get_ports {Res[50]}] [get_ports {Res[51]}] [get_ports {Res[52]}] [get_ports {Res[53]}] [get_ports {Res[54]}] [get_ports {Res[55]}] [get_ports {Res[56]}] [get_ports {Res[57]}] [get_ports {Res[58]}] [get_ports {Res[59]}] [get_ports {Res[60]}] [get_ports {Res[61]}] [get_ports {Res[62]}] [get_ports {Res[63]}]]
set_load 10 [get_ports {Res[63]}]
set_load 10 [get_ports {Res[62]}]
set_load 10 [get_ports {Res[61]}]
set_load 10 [get_ports {Res[60]}]
set_load 10 [get_ports {Res[59]}]
set_load 10 [get_ports {Res[58]}]
set_load 10 [get_ports {Res[57]}]
set_load 10 [get_ports {Res[56]}]
set_load 10 [get_ports {Res[55]}]
set_load 10 [get_ports {Res[54]}]
set_load 10 [get_ports {Res[53]}]
set_load 10 [get_ports {Res[52]}]
set_load 10 [get_ports {Res[51]}]
set_load 10 [get_ports {Res[50]}]
set_load 10 [get_ports {Res[49]}]
set_load 10 [get_ports {Res[48]}]
set_load 10 [get_ports {Res[47]}]
set_load 10 [get_ports {Res[46]}]
set_load 10 [get_ports {Res[45]}]
set_load 10 [get_ports {Res[44]}]
set_load 10 [get_ports {Res[43]}]
set_load 10 [get_ports {Res[42]}]
set_load 10 [get_ports {Res[41]}]
set_load 10 [get_ports {Res[40]}]
set_load 10 [get_ports {Res[39]}]
set_load 10 [get_ports {Res[38]}]
set_load 10 [get_ports {Res[37]}]
set_load 10 [get_ports {Res[36]}]
set_load 10 [get_ports {Res[35]}]
set_load 10 [get_ports {Res[34]}]
set_load 10 [get_ports {Res[33]}]
set_load 10 [get_ports {Res[32]}]
set_load 10 [get_ports {Res[31]}]
set_load 10 [get_ports {Res[30]}]
set_load 10 [get_ports {Res[29]}]
set_load 10 [get_ports {Res[28]}]
set_load 10 [get_ports {Res[27]}]
set_load 10 [get_ports {Res[26]}]
set_load 10 [get_ports {Res[25]}]
set_load 10 [get_ports {Res[24]}]
set_load 10 [get_ports {Res[23]}]
set_load 10 [get_ports {Res[22]}]
set_load 10 [get_ports {Res[21]}]
set_load 10 [get_ports {Res[20]}]
set_load 10 [get_ports {Res[19]}]
set_load 10 [get_ports {Res[18]}]
set_load 10 [get_ports {Res[17]}]
set_load 10 [get_ports {Res[16]}]
set_load 10 [get_ports {Res[15]}]
set_load 10 [get_ports {Res[14]}]
set_load 10 [get_ports {Res[13]}]
set_load 10 [get_ports {Res[12]}]
set_load 10 [get_ports {Res[11]}]
set_load 10 [get_ports {Res[10]}]
set_load 10 [get_ports {Res[9]}]
set_load 10 [get_ports {Res[8]}]
set_load 10 [get_ports {Res[7]}]
set_load 10 [get_ports {Res[6]}]
set_load 10 [get_ports {Res[5]}]
set_load 10 [get_ports {Res[4]}]
set_load 10 [get_ports {Res[3]}]
set_load 10 [get_ports {Res[2]}]
set_load 10 [get_ports {Res[1]}]
set_load 10 [get_ports {Res[0]}]
set_load 10 [get_ports OVF]
set_input_transition 0.1 [get_ports {A[31]}]
set_input_transition 0.1 [get_ports {A[30]}]
set_input_transition 0.1 [get_ports {A[29]}]
set_input_transition 0.1 [get_ports {A[28]}]
set_input_transition 0.1 [get_ports {A[27]}]
set_input_transition 0.1 [get_ports {A[26]}]
set_input_transition 0.1 [get_ports {A[25]}]
set_input_transition 0.1 [get_ports {A[24]}]
set_input_transition 0.1 [get_ports {A[23]}]
set_input_transition 0.1 [get_ports {A[22]}]
set_input_transition 0.1 [get_ports {A[21]}]
set_input_transition 0.1 [get_ports {A[20]}]
set_input_transition 0.1 [get_ports {A[19]}]
set_input_transition 0.1 [get_ports {A[18]}]
set_input_transition 0.1 [get_ports {A[17]}]
set_input_transition 0.1 [get_ports {A[16]}]
set_input_transition 0.1 [get_ports {A[15]}]
set_input_transition 0.1 [get_ports {A[14]}]
set_input_transition 0.1 [get_ports {A[13]}]
set_input_transition 0.1 [get_ports {A[12]}]
set_input_transition 0.1 [get_ports {A[11]}]
set_input_transition 0.1 [get_ports {A[10]}]
set_input_transition 0.1 [get_ports {A[9]}]
set_input_transition 0.1 [get_ports {A[8]}]
set_input_transition 0.1 [get_ports {A[7]}]
set_input_transition 0.1 [get_ports {A[6]}]
set_input_transition 0.1 [get_ports {A[5]}]
set_input_transition 0.1 [get_ports {A[4]}]
set_input_transition 0.1 [get_ports {A[3]}]
set_input_transition 0.1 [get_ports {A[2]}]
set_input_transition 0.1 [get_ports {A[1]}]
set_input_transition 0.1 [get_ports {A[0]}]
set_input_transition 0.1 [get_ports {B[31]}]
set_input_transition 0.1 [get_ports {B[30]}]
set_input_transition 0.1 [get_ports {B[29]}]
set_input_transition 0.1 [get_ports {B[28]}]
set_input_transition 0.1 [get_ports {B[27]}]
set_input_transition 0.1 [get_ports {B[26]}]
set_input_transition 0.1 [get_ports {B[25]}]
set_input_transition 0.1 [get_ports {B[24]}]
set_input_transition 0.1 [get_ports {B[23]}]
set_input_transition 0.1 [get_ports {B[22]}]
set_input_transition 0.1 [get_ports {B[21]}]
set_input_transition 0.1 [get_ports {B[20]}]
set_input_transition 0.1 [get_ports {B[19]}]
set_input_transition 0.1 [get_ports {B[18]}]
set_input_transition 0.1 [get_ports {B[17]}]
set_input_transition 0.1 [get_ports {B[16]}]
set_input_transition 0.1 [get_ports {B[15]}]
set_input_transition 0.1 [get_ports {B[14]}]
set_input_transition 0.1 [get_ports {B[13]}]
set_input_transition 0.1 [get_ports {B[12]}]
set_input_transition 0.1 [get_ports {B[11]}]
set_input_transition 0.1 [get_ports {B[10]}]
set_input_transition 0.1 [get_ports {B[9]}]
set_input_transition 0.1 [get_ports {B[8]}]
set_input_transition 0.1 [get_ports {B[7]}]
set_input_transition 0.1 [get_ports {B[6]}]
set_input_transition 0.1 [get_ports {B[5]}]
set_input_transition 0.1 [get_ports {B[4]}]
set_input_transition 0.1 [get_ports {B[3]}]
set_input_transition 0.1 [get_ports {B[2]}]
set_input_transition 0.1 [get_ports {B[1]}]
set_input_transition 0.1 [get_ports {B[0]}]
set_input_transition 0.1 [get_ports clk]
set_input_transition 0.1 [get_ports reset]
set_input_transition 0.1 [get_ports enable]
set_input_delay 0.2 [get_ports {A[31]}]
set_input_delay 0.2 [get_ports {A[30]}]
set_input_delay 0.2 [get_ports {A[29]}]
set_input_delay 0.2 [get_ports {A[28]}]
set_input_delay 0.2 [get_ports {A[27]}]
set_input_delay 0.2 [get_ports {A[26]}]
set_input_delay 0.2 [get_ports {A[25]}]
set_input_delay 0.2 [get_ports {A[24]}]
set_input_delay 0.2 [get_ports {A[23]}]
set_input_delay 0.2 [get_ports {A[22]}]
set_input_delay 0.2 [get_ports {A[21]}]
set_input_delay 0.2 [get_ports {A[20]}]
set_input_delay 0.2 [get_ports {A[19]}]
set_input_delay 0.2 [get_ports {A[18]}]
set_input_delay 0.2 [get_ports {A[17]}]
set_input_delay 0.2 [get_ports {A[16]}]
set_input_delay 0.2 [get_ports {A[15]}]
set_input_delay 0.2 [get_ports {A[14]}]
set_input_delay 0.2 [get_ports {A[13]}]
set_input_delay 0.2 [get_ports {A[12]}]
set_input_delay 0.2 [get_ports {A[11]}]
set_input_delay 0.2 [get_ports {A[10]}]
set_input_delay 0.2 [get_ports {A[9]}]
set_input_delay 0.2 [get_ports {A[8]}]
set_input_delay 0.2 [get_ports {A[7]}]
set_input_delay 0.2 [get_ports {A[6]}]
set_input_delay 0.2 [get_ports {A[5]}]
set_input_delay 0.2 [get_ports {A[4]}]
set_input_delay 0.2 [get_ports {A[3]}]
set_input_delay 0.2 [get_ports {A[2]}]
set_input_delay 0.2 [get_ports {A[1]}]
set_input_delay 0.2 [get_ports {A[0]}]
set_input_delay 0.2 [get_ports {B[31]}]
set_input_delay 0.2 [get_ports {B[30]}]
set_input_delay 0.2 [get_ports {B[29]}]
set_input_delay 0.2 [get_ports {B[28]}]
set_input_delay 0.2 [get_ports {B[27]}]
set_input_delay 0.2 [get_ports {B[26]}]
set_input_delay 0.2 [get_ports {B[25]}]
set_input_delay 0.2 [get_ports {B[24]}]
set_input_delay 0.2 [get_ports {B[23]}]
set_input_delay 0.2 [get_ports {B[22]}]
set_input_delay 0.2 [get_ports {B[21]}]
set_input_delay 0.2 [get_ports {B[20]}]
set_input_delay 0.2 [get_ports {B[19]}]
set_input_delay 0.2 [get_ports {B[18]}]
set_input_delay 0.2 [get_ports {B[17]}]
set_input_delay 0.2 [get_ports {B[16]}]
set_input_delay 0.2 [get_ports {B[15]}]
set_input_delay 0.2 [get_ports {B[14]}]
set_input_delay 0.2 [get_ports {B[13]}]
set_input_delay 0.2 [get_ports {B[12]}]
set_input_delay 0.2 [get_ports {B[11]}]
set_input_delay 0.2 [get_ports {B[10]}]
set_input_delay 0.2 [get_ports {B[9]}]
set_input_delay 0.2 [get_ports {B[8]}]
set_input_delay 0.2 [get_ports {B[7]}]
set_input_delay 0.2 [get_ports {B[6]}]
set_input_delay 0.2 [get_ports {B[5]}]
set_input_delay 0.2 [get_ports {B[4]}]
set_input_delay 0.2 [get_ports {B[3]}]
set_input_delay 0.2 [get_ports {B[2]}]
set_input_delay 0.2 [get_ports {B[1]}]
set_input_delay 0.2 [get_ports {B[0]}]
set_input_delay 0.2 [get_ports clk]
set_input_delay 0.2 [get_ports reset]
set_input_delay 0.2 [get_ports enable]
set_operating_conditions  -library  [get_libs {NangateOpenCellLibrary}] -max  typical
